import pytest
from fact import fact_rec, fact_it

@pytest.mark.parametrize("n, expected", [
    (1, 1),
    (2, 2),
    (5, 120),
    (10, 3628800),
    (100, 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000),
])
def test_fact_rec(n, expected):
    if n <= 500:  
        assert fact_rec(n) == expected
    else:
        pytest.skip("Рекурсивная функция не поддерживает столь большие значения n")

@pytest.mark.parametrize("n, expected", [
    (1, 1),
    (2, 2),
    (5, 120),
    (10, 3628800),
    (100, 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000),
])
def test_fact_it(n, expected):
    assert fact_it(n) == expected
